# ==========================================
# sec1-3
# sec4(1) 
print
cat

# ==========================================
# sec4(2) 
as.Date()
library(lubridate)

# ==========================================
# sec5 
seq로 원하는 날짜 구하기.
seq(from=as.Date(),to=as.Date(),by='year')

# ==========================================
# sec6(1)
vector다루기
setdiff         / 교집합 차집합.
name() <- c()   / 칼럼이름 지정하기.
append          / 원하는 위치에 원하는 숫자 넣기.
3 %in% var6     / 특정문자 포함여부 확인하기.
seq()
rep()

# ==========================================
# sec6(2)
matrix

# sec6(3)
array