# [빅데이터를 활용한 스마트 데이터 전문가 양성과정]
# 2019-05-29(수) / 294page

#Stackoverflow에서 모르는 부분을 검색한다.
#R은 Interpret방식(ex:java는 Compile방식)
# 0) R을 사용하면서 주의할 점 
# 1) Indentation: 조건식, 반복문, 함수 등
# 2) Comment: 주석을 알기쉽게 필기.

setwd("D:/dudwlsrla92/R_Data_Analysis/Part3/data") #
getwd() #current working directory

'test'

###===============================================================================
### Print와 Cat (출력하기) dgits 소수점 자리수 결정 ==============================
###===============================================================================

print(3) ; print(1+2) ; print('a') ; a<-3 ; print(a+3) ; print(pi)
print(pi,digits=4) # 소수점일 경우 총 7자리로 출력되기 때문에 digits로 자리수 지정.

cat(1,':','a','\n',2,':','b') #\n 줄바꾸기.
cat(1,'\n',2,'\n',3,'\n',4)
#print함수는 2개 이상 출력할 때 에러가 나기 때문에 cat함수를 쓴다.


#R은 java,c#와 달리 Data Type(해석방법이 다르기때문)에 상관없다.
###===================================================================================
### 1. 산술연산자(+ - * / %/% %% ^) ==================================================
###===================================================================================

print(5%/%2) #나눗셈의 몫
print(5%%2)  #나눗셈의 나머지 
# [x%%3=0]의 식을 이용해서 x값이 3의 배수인지 확인가능.
# [x%%2=1] x가 홀수인지.
# 1e+06(1000000) = 0이 6개 / 1e-06(0.000001) 소수점 6자리까지 표시


###===================================================================================
### 2. 문자형 숫자형 데이터 ==========================================================
###===================================================================================

'first' ; "first" ; first #앞의 2개는 문자, 뒤 first는 변수(x) 이름으로 인식이 된다.

as.numeric('1')+as.numeric('3') #숫자처럼 보이는 문자를 숫자로 변경해주는 명령어

class(1) ; class('1') # 문자,숫자인지 알려준다. (Data Type : numeric, character, logical, NA, NULL, Factor)


###===================================================================================
### 3. TRUE, FALSE 값(진리값) ========================================================
###===================================================================================

# $ (and, *, 둘다), | (or, +, 둘중 하나라도), ! (not, 반대) 
3&0; 3&1; 3&2; 3|0; 3|1; !0; !1; !3

###===================================================================================
### 4. NA(잘못된 값일 경우), NULL(값이 없을 경우) (na.rm=T 결측치 삭제)===============
###===================================================================================

cat(1,NA,2) ; cat(1,NULL,2)
sum(1,NA,2) ; sum(1,NULL,2) 
sum(1,NA,2,na.rm=T) #na.rm=T는 결측치를 없애준다.


###===================================================================================
### 5. 범주형 데이터 csv(comma separated values) =====================================
###===================================================================================

setwd("D:/dudwlsrla92/R_Data_Analysis/Part3/data")
txt1<-read.csv("factor_test.txt")

factor1<-factor(txt1$blood) #factor 범주형 데이터
gender1<-factor(txt1$sex)
summary(factor1) 
summary(gender1)
View(txt1)

stringsAsFactors=FALSE #factor 형태를 없애준다.