###===================================================================================
### 변수 설정하기 (주의사항:대소문자 구분) ===========================================
###===================================================================================

var1 <- "aaa"          ; var1
var2 <- 111            ; var2
var3 <- Sys.Date()     ; var3
var4 <- c('a',"b","c") ; var4
var5 <- var4 <- var3   ; var5 #덮어씌우기

string1 <- "Very Eaasy R Programming"   ; string1
string2 <- "I'm james Kim"              ; string2
string3 <- 'He said, "I am Ironman"'    ; string3
string4 <- "He said, \"I am Ironman\"." ; string4

comp <- c(1,'2') ; comp # 1도 '1'로 출력된다.
class(comp) #자동 형 변환: 숫자(numeric) 보다 문자가 강하다.

###===================================================================================
### 생성한 Values값 확인하기 objects() + hidden ======================================
###===================================================================================

objects()
.hidden <- 3 #점(.)으로 시작하면, Values창에 나타나지 않는다.
.hidden

###===================================================================================
### 변수 제거하기 [rm(list=ls())] ====================================================
###===================================================================================

rm(list=ls()) #모든변수 제거(.hidden은 제거에서 제외)
rm(string1)   #선택변수 제거
ls()          #변수목록 보기

# sum(1,NA,2,na.rm=T) #na.rm=T는 결측치를 없애준다.